In [1]:
import pandas as pd

### Задание 1

In [3]:
ratings = pd.read_csv('ratings.csv')
ratings.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [4]:
data = pd.read_csv('movies.csv')
data.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [14]:
movie_Id = ratings['movieId'].value_counts().index[0]

In [30]:
filtered_movie = data[data['movieId'] == movie_Id]
print(filtered_movie['title'].values[0])

Forrest Gump (1994)


### Задание 2

In [32]:
power = pd.read_csv('power.csv')
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [33]:
countries = power[(power['country']=='Latvia') | (power['country']=='Lithuania') | (power['country']=='Estonia')]

categorys = countries[(countries['category']== int(4)) | (countries['category']== int(12)) | (countries['category']== int(21))]

years = categorys[(categorys['year'] > int(2005)) | (categorys['year'] < int(2010))]
    
quantities = years[years['quantity'] > 0 ]
        
quantity_baltics = quantities['quantity'].sum()
            
print(f'Страны Прибалтики потребляют: {quantity_baltics}')

Страны Прибалтики потребляют: 970728.0

### Задание 3

In [34]:
pd.read_html('https://www.finanz.ru/valyuty/v-realnom-vremeni', thousands='.', encoding='utf-8')[1].head()

,Unnamed: 0,Рубль,Предложение,Спрос,Предыдущее закрытие,%,Абсолютное значение,Время
0,NaN,GBP/RUB,"97,5919",-,"97,6480","-0,06 %","-0,0561",20:59:00
1,NaN,EUR/RUB,"89,6875",-,"89,6510","0,04 %","0,0365",20:58:00
2,NaN,USD/RUB,"76,3041",-,"75,5145","1,05 %","0,7896",20:58:00
3,NaN,JPY/RUB,"0,7282",-,"0,7224","0,80 %","0,0058",20:59:00
4,NaN,CNY/RUB,"11,2126",-,"11,1561","0,51 %","0,0565",20:58:00